Revit 2027 API
BindingMap.Item Property
 The get_Item method will get the binding item related to the input key.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override Binding this[
	Definition key
] { get; set; }
Public Overrides Property Item (
	key As Definition
) As Binding
	Get
	Set
public:
virtual property Binding^ Item[Definition^ key] {
	Binding^ get (Definition^ key) override;
	void set (Definition^ key, Binding^ value) override;
}
abstract Item : Binding with get, set
override Item : Binding with get, set
Parameters
key Definition
 A parameter definition which can be an existing definition or one from a shared parameters file.
Property Value
Binding
 The returned value of get_Item is an InstanceBinding or TypeBinding object that contains the set of categories to which the parameter is bound. The input item is an InstanceBinding or TypeBinding object which contains the set of categories to which the parameter should be bound.
Remarks
 set_Item is not permitted for this class. A Autodesk::Revit::Exceptions::InvalidOperationException will be thrown. Instead use Insert, Remove and ReInsert to modify the bindings in the document.
See Also
Reference
BindingMap Class
Autodesk.Revit.DB Namespace